icamgo/noduino-sdk/arch/efm32/cores/efm32/HardwareSerial.cpp
/*
  Copyright (c) 2018 huaweiwx@sina.com 2018.7.1

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "Arduino.h"

#if defined(USART0)&& (USE_USART0 >0)
USART_Buf_TypeDef* USART0_buf = 0;
#endif
#if defined(USART1)&& (USE_USART1 >0)
USART_Buf_TypeDef* USART1_buf = 0;
#endif
#if defined(USART2)&& (USE_USART2 >0)
USART_Buf_TypeDef* USART2_buf = 0;
#endif
#if defined(USART3)&& (USE_USART3 >0)
USART_Buf_TypeDef* USART3_buf = 0;
#endif
#if defined(USART4)&& (USE_USART4 >0)
USART_Buf_TypeDef* USART4_buf = 0;
#endif
#if defined(USART5)&& (USE_USART5 >0)
USART_Buf_TypeDef* USART5_buf = 0;
#endif
#if  defined(UART0) && (USE_UART0 >0)
USART_Buf_TypeDef* UART0_buf = 0;
#endif
#if  defined(UART1) && (USE_UART1 >0)
USART_Buf_TypeDef* UART1_buf = 0;
#endif
#if defined(LEUART0)&& (USE_LEUART0 >0)
USART_Buf_TypeDef* LEUART0_buf = 0;
#endif
#if defined(LEUART1)&& (USE_LEUART1 >0)
USART_Buf_TypeDef* LEUART1_buf = 0;
#endif

HardwareSerial::HardwareSerial(USART_TypeDef *instance) {
  this->instance = instance;
}

void HardwareSerial::setRouteLoc(uint8_t route) {
      routeLoc = route;
      USART_ROUTE_LOCATION_LOCx = route<<8;
}

#if 0
void HardwareSerial::initSpiGpio(USART_Mode_TypeDef  spiMode) {
	
  USART_TypeDef *spi = this->instance;	
  /* Setting baudrate */
  spi->CLKDIV = 128 * (SPI_PERCLK_FREQUENCY / SPI_BAUDRATE - 2);

  /* Configure SPI */
  /* Using synchronous (SPI) mode*/

  spi->CTRL = USART_CTRL_SYNC;
  /* Clearing old transfers/receptions, and disabling interrupts */
  spi->CMD = USART_CMD_CLEARRX | USART_CMD_CLEARTX;
  spi->IEN = 0;
  /* Enabling pins and setting location */
  spi->ROUTE = USART_ROUTE_TXPEN | USART_ROUTE_RXPEN | USART_ROUTE_CLKPEN | USART_ROUTE_CSPEN | USART_ROUTE_LOCATION_LOCx;
	
    /* Set GPIO config to master */
  GPIO_Mode_TypeDef   gpioModeMosi = gpioModePushPull;
  GPIO_Mode_TypeDef   gpioModeMiso = gpioModeInput;
  GPIO_Mode_TypeDef   gpioModeCs   = gpioModePushPull;
  GPIO_Mode_TypeDef   gpioModeClk  = gpioModePushPull;

  if(spiMode == SPI_MAST_TYPE){
	gpioModeMosi = gpioModePushPull;
	gpioModeMiso = gpioModeInput;
	gpioModeCs   = gpioModePushPull;
	gpioModeClk  = gpioModePushPull;
  }else{
    /* Enabling TX and RX */
    spi->CMD = USART_CMD_TXEN | USART_CMD_RXEN;
  }
  /* Clear previous interrupts */
  spi->IFC = _USART_IFC_MASK;

  /* IO configuration */
#ifdef USART0
  if(spi == USART0){
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_TX_PORT(routeLoc), AF_USART0_TX_PIN(routeLoc), gpioModeMosi, 0);  /* TX/MOSI */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_RX_PORT(routeLoc), AF_USART0_RX_PIN(routeLoc), gpioModeMiso, 0);  /* RX/MISO */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_CS_PORT(routeLoc), AF_USART0_CS_PIN(routeLoc), gpioModeCs,   0);  /* CS */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_CLK_PORT(routeLoc),AF_USART0_CLK_PIN(routeLoc),gpioModeClk,  0);  /* Clock */
  }
#endif
#ifdef USART1 
  if(spi == USART1){
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_TX_PORT(routeLoc), AF_USART0_TX_PIN(routeLoc), gpioModeMosi, 0);  /* TX/MOSI */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_RX_PORT(routeLoc), AF_USART0_RX_PIN(routeLoc), gpioModeMiso, 0);  /* RX/MISO */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_CS_PORT(routeLoc), AF_USART0_CS_PIN(routeLoc), gpioModeCs,   0);  /* CS */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_CLK_PORT(routeLoc),AF_USART0_CLK_PIN(routeLoc),gpioModeClk,  0);  /* Clock */
  }
#endif
#ifdef USART2
  if(spi == USART2){
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_TX_PORT(routeLoc), AF_USART0_TX_PIN(routeLoc), gpioModeMosi, 0);  /* TX/MOSI */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_RX_PORT(routeLoc), AF_USART0_RX_PIN(routeLoc), gpioModeMiso, 0);  /* RX/MISO */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_CS_PORT(routeLoc), AF_USART0_CS_PIN(routeLoc), gpioModeCs,   0);  /* CS */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART2_CLK_PORT(routeLoc),AF_USART0_CLK_PIN(routeLoc),gpioModeClk,  0);  /* Clock */
  };
#endif
#ifdef USART3
  if(spi == USART3){
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_TX_PORT(routeLoc), AF_USART0_TX_PIN(routeLoc), gpioModeMosi, 0);  /* TX/MOSI */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_RX_PORT(routeLoc), AF_USART0_RX_PIN(routeLoc), gpioModeMiso, 0);  /* RX/MISO */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_CS_PORT(routeLoc), AF_USART0_CS_PIN(routeLoc), gpioModeCs,   0);  /* CS */
	GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART3_CLK_PORT(routeLoc),AF_USART0_CLK_PIN(routeLoc),gpioModeClk,  0);  /* Clock */
  };
#endif
}
#endif

void HardwareSerial::initSerialGpio(void) {

	CMU_ClockEnable(cmuClock_GPIO, true);

#if  defined(USART0)&& (USE_USART0 >0)
  if (this->instance == USART0) {
	 
    /* To avoid false start, configure output as high */
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_TX_PORT(this->routeLoc),
                    AF_USART0_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART0_RX_PORT(this->routeLoc),
                    AF_USART0_RX_PIN(this->routeLoc),
                    gpioModeInputPull, 0);
	buf->mode = USART_TYPE;
    }
#endif

#if   defined(USART1)&& (USE_USART1 >0)
  if (this->instance == USART1) {
	/*
	 * gpioModePushPull: Push-pull output
	 * gpioModePushPullDrive: Push-pull output with drive-strength set by DRIVEMODE
	 * gpioModeWiredAnd: Open-drain output
	 * gpioModeWiredAndFilter: Open-drain output with filter
	 * gpioModeWiredAndPullUp: Open-drain output with pullup
	*/
    GPIO_PinModeSet((GPIO_Port_TypeDef)AF_USART1_TX_PORT(this->routeLoc),
                    AF_USART1_TX_PIN(this->routeLoc),
                    gpioModePushPull, 1);

