icamgo/noduino-sdk/arch/efm32/cores/efm32/HardwareSerial.cpp
  }
}

void HardwareSerial::initPort(void) {
  
#if  defined(USART0)&& (USE_USART0 >0)
  if (this->instance == USART0) {
    USART0_buf = buf;
    USART_Reset(USART0);
    CMU_ClockEnable(cmuClock_USART0, true);
  }
#endif

#if   defined(USART1)&& (USE_USART1 >0)
  if (this->instance == USART1) {
    USART1_buf = buf;
    USART_Reset(USART1);
    CMU_ClockEnable(cmuClock_USART1, true);
  }
#endif

#if   defined(USART2)&& (USE_USART2 >0)
  if (this->instance == USART2) {
    USART2_buf = buf;
    USART_Reset(USART2);
    CMU_ClockEnable(cmuClock_USART2, true);
  }
#endif

#if   defined(USART3)&& (USE_USART3 >0)
  if (this->instance == USART3) {
    USART3_buf = buf;
    USART_Reset(USART3);
    CMU_ClockEnable(cmuClock_USART3, true);
  }
#endif

#if   defined(USART4)&& (USE_USART4 >0)
  if (this->instance == USART4) {
    USART4_buf = buf;
    USART_Reset(USART4);
    CMU_ClockEnable(cmuClock_USART4, true);
  }
#endif

#if   defined(USART5)&& (USE_USART5 >0)
  if (this->instance == USART5) {
    USART5_buf = buf;
    USART_Reset(USART5);
    CMU_ClockEnable(cmuClock_USART5, true);
  }
#endif
#if   defined(UART0)&& (USE_UART0 >0)
  if (this->instance == UART0) {
    UART0_buf = buf;
    UART_Reset(UART0);
    CMU_ClockEnable(cmuClock_UART0, true);
  }
#endif
#if   defined(UART1)&& (USE_UART1 >0)
  if (this->instance == UART1) {
    UART0_buf = buf;
    UART_Reset(UART1);
    CMU_ClockEnable(cmuClock_UART1, true);
  }
#endif

#if defined(LEUART0)&& (USE_LEUART0 >0)
  if (this->instance == (USART_TypeDef *)LEUART0) {

    LEUART0_buf = buf;
    LEUART_Reset(LEUART0);

    /* Enable clock for LEUART0 */
    CMU_ClockEnable(cmuClock_HFLE, true); // Necessary for accessing LE modules

	if (this->baud > 9600) {
		// Set CORELEDIV2 reference clock
		CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_CORELEDIV2);
	} else {
#if USE_LFBLFXO >0
		// use LFXO 32.768KHz as the clock source of LFB
		CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFXO);
#elif USE_LFBLFRCO > 0
		// use LFRCO 32.768KHz as the clock source of LFB
		CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFRCO);
#endif
	}

    CMU_ClockEnable(cmuClock_LEUART0, true);
	CMU_ClockDivSet(cmuClock_LEUART0, cmuClkDiv_1); // Don't prescale LEUART clock

    LEUART_Init_TypeDef init = LEUART_INIT_DEFAULT;
    init.enable = leuartDisable;
	init.baudrate = this->baud;
    LEUART_Init(LEUART0, &init);
	#ifndef UART_NO_RX_INT
    LEUART0->IEN = LEUART_IEN_RXDATAV;
    LEUART0->ROUTE = USART_ROUTE_LOCATION_LOCx | LEUART_ROUTE_RXPEN | LEUART_ROUTE_TXPEN;
	#else
    LEUART0->ROUTE = USART_ROUTE_LOCATION_LOCx | LEUART_ROUTE_TXPEN;
	#endif
  }
#endif

#if   defined(LEUART1)&& (USE_LEUART1 >0)
  if (this->instance == (USART_TypeDef *)LEUART1) {
    LEUART1_buf = buf;
    LEUART_Reset(LEUART1);
    /* Enable clock for LEUART1 */
    CMU_ClockEnable(cmuClock_HFLE, true); // Necessary for accessing LE modules
#if USE_LFBLFXO >0
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFXO); // Set LFXO reference clock baud <=9600
#elif USE_LFBLFRCO > 0
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFRCO); // Set LFRCO reference clock baud <=9600
#else
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_CORELEDIV2); // Set CORELEDIV2 reference clock
#endif
    CMU_ClockEnable(cmuClock_LEUART1, true);
    LEUART_Init_TypeDef init = LEUART_INIT_DEFAULT;
    init.enable = leuartDisable;
	init.baudrate = this->baud;
    LEUART_Init(LEUART1, &init);
    LEUART1->IEN = LEUART_IEN_RXDATAV;
    LEUART1->ROUTE = USART_ROUTE_LOCATION_LOCx | LEUART_ROUTE_RXPEN | LEUART_ROUTE_TXPEN;
  }
#endif
  
#if defined(USART0)&& (USE_USART0 >0)
  if (this->instance == USART0) {
    NVIC_ClearPendingIRQ(USART0_RX_IRQn);
    NVIC_EnableIRQ(USART0_RX_IRQn);
    NVIC_ClearPendingIRQ(USART0_TX_IRQn);
    NVIC_EnableIRQ(USART0_TX_IRQn);
  }
#endif
#if defined(USART1)&& (USE_USART1 >0)
  if (this->instance == USART1) {

    NVIC_ClearPendingIRQ(USART1_RX_IRQn);
    NVIC_EnableIRQ(USART1_RX_IRQn);
    NVIC_ClearPendingIRQ(USART1_TX_IRQn);
    NVIC_EnableIRQ(USART1_TX_IRQn);
  }
#endif
#if defined(USART2)&& (USE_USART2 >0)
  if (this->instance == USART2) {
    NVIC_ClearPendingIRQ(USART2_RX_IRQn);
    NVIC_EnableIRQ(USART2_RX_IRQn);
    NVIC_ClearPendingIRQ(USART2_TX_IRQn);
    NVIC_EnableIRQ(USART2_TX_IRQn);
  }
#endif
#if defined(USART3)&& (USE_USART3 >0)
  if (this->instance == USART3) {
    NVIC_ClearPendingIRQ(USART3_RX_IRQn);
    NVIC_EnableIRQ(USART3_RX_IRQn);
    NVIC_ClearPendingIRQ(USART3_TX_IRQn);
    NVIC_EnableIRQ(USART3_TX_IRQn);
  }
#endif
#if defined(USART4)&& (USE_USART4 >0)
  if (this->instance == USART4) {
    NVIC_ClearPendingIRQ(USART4_RX_IRQn);
    NVIC_EnableIRQ(USART4_RX_IRQn);
    NVIC_ClearPendingIRQ(USART4_TX_IRQn);
    NVIC_EnableIRQ(USART4_TX_IRQn);
  }
#endif
#if defined(USART5)&& (USE_USART5 >0)
  if (this->instance == USART5) {
    NVIC_ClearPendingIRQ(USART5_RX_IRQn);
    NVIC_EnableIRQ(USART5_RX_IRQn);
    NVIC_ClearPendingIRQ(USART5_TX_IRQn);
    NVIC_EnableIRQ(USART5_TX_IRQn);
  }
#endif
#if defined(UART0)&& (USE_UART0 >0)
  if (this->instance == UART0) {
    NVIC_ClearPendingIRQ(UART0_RX_IRQn);
    NVIC_EnableIRQ(UART0_RX_IRQn);
    NVIC_ClearPendingIRQ(UART0_TX_IRQn);
    NVIC_EnableIRQ(UART0_TX_IRQn);
  }
#endif
#if defined(UART1)&& (USE_UART1 >0)
  if (this->instance == UART1) {
    NVIC_ClearPendingIRQ(UART1_RX_IRQn);
    NVIC_EnableIRQ(UART1_RX_IRQn);
    NVIC_ClearPendingIRQ(UART1_TX_IRQn);
    NVIC_EnableIRQ(UART1_TX_IRQn);
  }
#endif
#if defined(LEUART0)&& (USE_LEUART0 >0)
  if (this->instance == (USART_TypeDef *)LEUART0) {
    NVIC_ClearPendingIRQ(LEUART0_IRQn);
    NVIC_EnableIRQ(LEUART0_IRQn);
	#ifndef UART_NO_RX_INT
    LEUART0->IEN = LEUART_IEN_RXDATAV;
	#endif
    LEUART_Enable(LEUART0, leuartEnable);

  }
#endif
#if defined(LEUART1)&& (USE_LEUART1 >0)
  if (this->instance == (USART_TypeDef *)LEUART1) {
    NVIC_ClearPendingIRQ(LEUART1_IRQn);
    NVIC_EnableIRQ(LEUART1_IRQn);
    LEUART1->IEN = LEUART_IEN_RXDATAV;
    LEUART_Enable(LEUART1, leuartEnable);
  }
#endif
}

void HardwareSerial::end(void) {}

int HardwareSerial::available(void)
{
  return ((unsigned int)(SERIAL_RX_BUFFER_SIZE + buf->rxEnd - buf->rxStart)) % SERIAL_RX_BUFFER_SIZE;
}

int HardwareSerial::availableForWrite(void)
{
  if (buf->txEnd >= buf->txStart) return SERIAL_TX_BUFFER_SIZE - 1 - (buf->txEnd - buf->txStart); /*SERIAL_TX_BUFFER_SIZE-1 ~ 0*/
  return buf->txStart - buf->txEnd - 1;
}

