icamgo/noduino-sdk/arch/efm32/cores/efm32/HardwareSerial.cpp
void HardwareSerial::clear_rxbuf(void)
{
	noInterrupts();

	//memset(buf->rxBuffer, 0, SERIAL_RX_BUFFER_SIZE);

	buf->rxStart = buf->rxEnd;

	interrupts();
}

int HardwareSerial::peek(void)
{
  if (available()) {
    return buf->rxBuffer[buf->rxStart];
  } else {
    return -1;
  }
}

void HardwareSerial::flush(void) {
#ifndef DEBUG_UART
  while (buf->txEnd != buf-> txStart);
#endif
}

int HardwareSerial::read(void) {
  if (available()) {
    uint8_t rtn =  buf->rxBuffer[buf->rxStart++];
    buf->rxStart %= SERIAL_RX_BUFFER_SIZE;
    return rtn;
  } else {
    return -1;
  }
}

size_t HardwareSerial::write(unsigned char ch) {
#ifdef DEBUG_UART /*for debug unused interrupt*/
    if (buf->mode == LEUART_TYPE) {
      LEUART_Tx((LEUART_TypeDef *)buf->instance, ch);
    }
  #if defined(UART0)||defined(UART1)
    else if(buf->mode == UART_TYPE){
      UART_Tx(buf->instance, ch);
    }
  #endif
    else {
      USART_Tx(buf->instance, ch);
    }

#else
  while (availableForWrite() == 0);   /*wait*/
  buf->txBuffer[buf->txEnd++] = ch;
  buf->txEnd %= SERIAL_TX_BUFFER_SIZE;
  if (buf->mode == LEUART_TYPE) {
    LEUART_IntEnable((LEUART_TypeDef *)buf->instance, LEUART_IEN_TXC);
    LEUART_IntSet((LEUART_TypeDef *)buf->instance, LEUART_IFS_TXC);
  }
#if defined(UART0)||defined(UART1)
  else if(buf->mode == UART_TYPE){
    UART_IntEnable(buf->instance, UART_IEN_TXC);
    UART_IntSet(buf->instance, UART_IFS_TXC);
  }
#endif
  else {
    USART_IntEnable(buf->instance, USART_IEN_TXC);
    USART_IntSet(buf->instance, USART_IFS_TXC);
  }
#endif  
  return 1;
}

void USART_TXCallback(USART_Buf_TypeDef *interruptUART) {
  if (interruptUART->txStart != interruptUART->txEnd) {
    USART_Tx(interruptUART->instance, interruptUART->txBuffer[interruptUART->txStart++]);
    interruptUART->txStart %= SERIAL_TX_BUFFER_SIZE;
  }
}
void USART_RXCallback(USART_Buf_TypeDef *interruptUART) {
  if (((interruptUART->rxEnd + 1) % SERIAL_RX_BUFFER_SIZE) == interruptUART->rxStart) return; /*over*/
  interruptUART->rxBuffer[interruptUART->rxEnd++] = USART_Rx(interruptUART->instance);
  interruptUART->rxEnd %= SERIAL_RX_BUFFER_SIZE;
}
#if defined(USART0) && (USE_USART0 >0)
void (*usart0_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart0_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART0_RX_IRQHandler(void)
{
    uint32_t flags = USART_IntGet(USART0);
    USART_IntClear(USART0, flags);
    if (flags & USART_IF_RXDATAV) usart0_rxCallbBck(USART0_buf);
}
extern "C"
void USART0_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART0);
  USART_IntClear(USART0, flags);
  if (flags & USART_IF_TXC) usart0_txCallbBck(USART0_buf);
}
HardwareSerial Serial0(USART0);
#endif

#if defined(USART1) && (USE_USART1 >0)
void (*usart1_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart1_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART1_RX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART1);
  USART_IntClear(USART1, flags);
  if (flags & USART_IF_RXDATAV) usart1_rxCallbBck(USART1_buf);
}
extern "C"
void USART1_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART1);
  USART_IntClear(USART1, flags);
  if (flags & USART_IF_TXC) usart1_txCallbBck(USART1_buf);
}
HardwareSerial SerialUSART1(USART1);
#endif

#if defined(USART2) && (USE_USART2 >0)
void (*usart2_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart2_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART2_RX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART2);
  USART_IntClear(USART2, flags);
  if (flags & USART_IF_RXDATAV) usart2_rxCallbBck(USART2_buf);
}
extern "C"
void USART2_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART2);
  USART_IntClear(USART2, flags);
  if (flags & USART_IF_TXC) usart2_txCallbBck(USART2_buf);
}
HardwareSerial SerialUSART2(USART2);
#endif

#if defined(USART3) && (USE_USART3 >0)
void (*usart3_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart3_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART3_RX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART3);
  USART_IntClear(USART3, flags);
  if (flags & USART_IF_RXDATAV) usart3_rxCallbBck(USART3_buf);
}
extern "C"
void USART3_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART3);
  USART_IntClear(USART3, flags);
  if (flags & USART_IF_TXC) usart3_txCallbBck(USART3_buf);
}
HardwareSerial SerialUSART3(USART3);
#endif

#if defined(USART4) && (USE_USART4 >0)
void (*usart4_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart4_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART4_RX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART4);
  USART_IntClear(USART4, flags);
  if (flags & USART_IF_RXDATAV) usart4_rxCallbBck(USART4_buf);
}
extern "C"
void USART4_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART4);
  USART_IntClear(USART4, flags);
  if (flags & USART_IF_TXC) usart4_txCallbBck(USART4_buf);
}
HardwareSerial SerialUSART4(USART4);
#endif

#if defined(USART5) && (USE_USART5 >0)
void (*usart5_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_RXCallback;
void (*usart5_txCallbBck)(USART_Buf_TypeDef *interruptUART) = USART_TXCallback;
extern "C"
void USART5_RX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART5);
  USART_IntClear(USART5, flags);
  if (flags & USART_IF_RXDATAV) usart5_rxCallbBck(USART5_buf);
}
extern "C"
void USART5_TX_IRQHandler(void)
{
  uint32_t flags = USART_IntGet(USART5);
  USART_IntClear(USART5, flags);
  if (flags & USART_IF_TXC) usart5_txCallbBck(USART5_buf);
}
HardwareSerial SerialUSART5(USART5);
#endif

#if defined(UART0)||defined(UART1)
void UART_TXCallback(USART_Buf_TypeDef *interruptUART) {
  if (interruptUART->txStart != interruptUART->txEnd) {
    UART_Tx((UART_TypeDef *)interruptUART->instance, interruptUART->txBuffer[interruptUART->txStart++]);
    interruptUART->txStart %= SERIAL_TX_BUFFER_SIZE;
  }
}
void UART_RXCallback(USART_Buf_TypeDef *interruptUART) {
  if (((interruptUART->rxEnd + 1) % SERIAL_RX_BUFFER_SIZE) == interruptUART->txStart) return; /*over*/
  interruptUART->rxBuffer[interruptUART->rxEnd++] = USART_Rx((UART_TypeDef *)interruptUART->instance);
  interruptUART->rxEnd %= SERIAL_RX_BUFFER_SIZE;
}

#if defined(UART0) && (USE_UART0 >0)
void (*uart0_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = UART_RXCallback;
void (*uart0_txCallbBck)(USART_Buf_TypeDef *interruptUART) = UART_TXCallback;
extern "C"
void UART0_RX_IRQHandler(void)
{
  uint32_t flags = UART_IntGet(UART0);
  UART_IntClear(UART0, flags);
  if (flags & UART_IF_RXDATAV) uart0_rxCallbBck(UART0_buf);
}
extern "C"
void UART0_TX_IRQHandler(void)
{
  uint32_t flags = UART_IntGet(UART0);
  UART_IntClear(UART0, flags);
  if (flags & UART_IF_TXC) uart0_txCallbBck(UART0_buf);
}
HardwareSerial SerialUART0((USART_TypeDef *)UART0);
#  endif

#  if defined(UART1) && (USE_UART1 >0)
void (*uart1_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = UART_RXCallback;
void (*uart1_txCallbBck)(USART_Buf_TypeDef *interruptUART) = UART_TXCallback;
extern "C"
void UART1_RX_IRQHandler(void)
{
  uint32_t flags = UART_IntGet(UART1);
  UART_IntClear(UART1, flags);
  if (flags & UART_IF_RXDATAV) uart1_rxCallbBck(UART1_buf);
}
extern "C"
void UART1_TX_IRQHandler(void)
{
  uint32_t flags = UART_IntGet(UART1);
  UART_IntClear(UART1, flags);
  if (flags & UART_IF_TXC) uart1_txCallbBck(UART1_buf);
}
HardwareSerial SerialUART1((USART_TypeDef *)UART1);
#  endif
#endif

#if (defined(LEUART0)&&(USE_LEUART0 >0))||(defined(LEUART1)&&(USE_LEUART1 >0))
void LEUART_TXCallback(USART_Buf_TypeDef *interruptUART) {
  if (interruptUART->txStart != interruptUART->txEnd) {
    LEUART_Tx((LEUART_TypeDef *)interruptUART->instance, interruptUART->txBuffer[interruptUART->txStart++]);
    interruptUART->txStart %= SERIAL_TX_BUFFER_SIZE;
  }
}
#ifndef UART_NO_RX_INT
void LEUART_RXCallback(USART_Buf_TypeDef *interruptUART) {
  if (((interruptUART->rxEnd + 1) % SERIAL_RX_BUFFER_SIZE) == interruptUART->txStart) return; /*over*/
  interruptUART->rxBuffer[interruptUART->rxEnd++] = LEUART_Rx((LEUART_TypeDef *)interruptUART->instance);
  interruptUART->rxEnd %= SERIAL_RX_BUFFER_SIZE;
}
#endif
#if defined(LEUART0) && (USE_LEUART0 >0)
#ifndef UART_NO_RX_INT
void (*leuart0_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = LEUART_RXCallback;
#endif
void (*leuart0_txCallbBck)(USART_Buf_TypeDef *interruptUART) = LEUART_TXCallback;

extern "C"
void LEUART0_IRQHandler(void)
{
  uint32_t flags = LEUART_IntGet(LEUART0);
  LEUART_IntClear(LEUART0, flags);
#ifndef UART_NO_RX_INT
  if (flags & LEUART_IF_RXDATAV) leuart0_rxCallbBck(LEUART0_buf);
#endif
  if (flags & LEUART_IF_TXC)     leuart0_txCallbBck(LEUART0_buf);
}
HardwareSerial SerialLEUART0((USART_TypeDef *)LEUART0);
#  endif
#  if defined(LEUART1) && (USE_LEUART1 >0)
void (*leuart1_rxCallbBck)(USART_Buf_TypeDef *interruptUART) = LEUART_RXCallback;
void (*leuart1_txCallbBck)(USART_Buf_TypeDef *interruptUART) = LEUART_TXCallback;
extern "C"
void LEUART1_IRQHandler(void)
{
  uint32_t flags = LEUART_IntGet(LEUART1);
  LEUART_IntClear(LEUART1, flags);
  if (flags & LEUART_IF_RXDATAV) leuart1_rxCallbBck(LEUART1_buf);
  if (flags & LEUART_IF_TXC)     leuart1_txCallbBck(LEUART1_buf);
}
HardwareSerial SerialLEUART1((USART_TypeDef *)LEUART1);
#  endif
#endif
